docs/20231222 - RKE2 100 clusters 1vs3 nodes comparison/tests_raw_data/benchmark_RKE30-c_management.cattle.io.setting.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: ./steve_paginated_api_benchmark.js
     output: -

  scenarios: (100.00%) 1 scenario, 1 max VUs, 24h0m30s max duration (incl. graceful stop):
           * list: 30 iterations for each of 1 VUs (maxDuration: 24h0m0s, exec: list, gracefulStop: 30s)


running (0d00h00m01.0s), 1/1 VUs, 14 complete and 0 interrupted iterations
list   [  47% ] 1 VUs  0d00h00m00.8s/24h0m0s  14/30 iters, 30 per VU

     ✓ listing management.cattle.io.setting from cluster local (k8s style pagination) succeeds
     ✓ no slow pagination errors (410 Gone) detected

     █ setup

       ✓ logging in returns status 200

   ✓ checks.........................: 100.00% ✓ 121       ✗ 0  
     data_received..................: 4.8 MB  2.8 MB/s
     data_sent......................: 23 kB   13 kB/s
     http_req_blocked...............: avg=2.07ms   min=250ns   med=281ns    max=122.02ms p(90)=441ns    p(95)=551ns   
     http_req_connecting............: avg=32.43µs  min=0s      med=0s       max=1.12ms   p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=22.79ms  min=9.06ms  med=28.17ms  max=76.14ms  p(90)=34.18ms  p(95)=37.48ms 
       { expected_response:true }...: avg=22.79ms  min=9.06ms  med=28.17ms  max=76.14ms  p(90)=34.18ms  p(95)=37.48ms 
     http_req_failed................: 0.00%   ✓ 0         ✗ 61 
     http_req_receiving.............: avg=766.63µs min=63.81µs med=389.53µs max=3.23ms   p(90)=1.74ms   p(95)=2.09ms  
     http_req_sending...............: avg=211.73µs min=34.71µs med=43.96µs  max=3.94ms   p(90)=131.99µs p(95)=782.22µs
     http_req_tls_handshaking.......: avg=109.94µs min=0s      med=0s       max=3.37ms   p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=21.81ms  min=8.85ms  med=26.79ms  max=75.89ms  p(90)=33.05ms  p(95)=34.89ms 
     http_reqs......................: 61      35.222102/s
     iteration_duration.............: avg=55.81ms  min=45.38ms med=48.88ms  max=198.5ms  p(90)=59.42ms  p(95)=70.35ms 
     iterations.....................: 30      17.322345/s
     vus............................: 1       min=1       max=1
     vus_max........................: 1       min=1       max=1


running (0d00h00m01.7s), 0/1 VUs, 30 complete and 0 interrupted iterations
list ✓ [ 100% ] 1 VUs  0d00h00m01.5s/24h0m0s  30/30 iters, 30 per VU