docs/20231222 - RKE2 100 clusters 1vs3 nodes comparison/tests_raw_data/benchmark_RKE31-a_management.cattle.io.clusters.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: ./steve_paginated_api_benchmark.js
     output: -

  scenarios: (100.00%) 1 scenario, 1 max VUs, 24h0m30s max duration (incl. graceful stop):
           * list: 30 iterations for each of 1 VUs (maxDuration: 24h0m0s, exec: list, gracefulStop: 30s)


running (0d00h00m01.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
list   [   7% ] 1 VUs  0d00h00m00.9s/24h0m0s  02/30 iters, 30 per VU

running (0d00h00m02.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
list   [  17% ] 1 VUs  0d00h00m01.9s/24h0m0s  05/30 iters, 30 per VU

running (0d00h00m03.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
list   [  27% ] 1 VUs  0d00h00m02.9s/24h0m0s  08/30 iters, 30 per VU

running (0d00h00m04.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
list   [  37% ] 1 VUs  0d00h00m03.9s/24h0m0s  11/30 iters, 30 per VU

running (0d00h00m05.0s), 1/1 VUs, 14 complete and 0 interrupted iterations
list   [  47% ] 1 VUs  0d00h00m04.9s/24h0m0s  14/30 iters, 30 per VU

running (0d00h00m06.0s), 1/1 VUs, 17 complete and 0 interrupted iterations
list   [  57% ] 1 VUs  0d00h00m05.9s/24h0m0s  17/30 iters, 30 per VU

running (0d00h00m07.0s), 1/1 VUs, 20 complete and 0 interrupted iterations
list   [  67% ] 1 VUs  0d00h00m06.9s/24h0m0s  20/30 iters, 30 per VU

running (0d00h00m08.0s), 1/1 VUs, 22 complete and 0 interrupted iterations
list   [  73% ] 1 VUs  0d00h00m07.9s/24h0m0s  22/30 iters, 30 per VU

running (0d00h00m09.0s), 1/1 VUs, 25 complete and 0 interrupted iterations
list   [  83% ] 1 VUs  0d00h00m08.9s/24h0m0s  25/30 iters, 30 per VU

running (0d00h00m10.0s), 1/1 VUs, 29 complete and 0 interrupted iterations
list   [  97% ] 1 VUs  0d00h00m09.9s/24h0m0s  29/30 iters, 30 per VU

     ✓ listing management.cattle.io.clusters from cluster local (k8s style pagination) succeeds
     ✓ no slow pagination errors (410 Gone) detected

     █ setup

       ✓ logging in returns status 200

   ✓ checks.........................: 100.00% ✓ 121      ✗ 0  
     data_received..................: 41 MB   3.9 MB/s
     data_sent......................: 82 kB   7.9 kB/s
     http_req_blocked...............: avg=177.35µs min=230ns   med=320ns    max=6.97ms   p(90)=550ns    p(95)=801ns   
     http_req_connecting............: avg=27.18µs  min=0s      med=0s       max=895.97µs p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=138.73ms min=9.09ms  med=76.74ms  max=316.09ms p(90)=298.77ms p(95)=310.83ms
       { expected_response:true }...: avg=138.73ms min=9.09ms  med=76.74ms  max=316.09ms p(90)=298.77ms p(95)=310.83ms
     http_req_failed................: 0.00%   ✓ 0        ✗ 61 
     http_req_receiving.............: avg=4.62ms   min=59.93µs med=297.72µs max=16.02ms  p(90)=11.68ms  p(95)=12.82ms 
     http_req_sending...............: avg=627.73µs min=36.38µs med=73.68µs  max=6.5ms    p(90)=2.48ms   p(95)=5.11ms  
     http_req_tls_handshaking.......: avg=136.34µs min=0s      med=0s       max=5.4ms    p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=133.48ms min=8.88ms  med=76.49ms  max=305.17ms p(90)=289.68ms p(95)=300.45ms
     http_reqs......................: 61      5.908757/s
     iteration_duration.............: avg=332.98ms min=84.15ms med=333.56ms max=392.54ms p(90)=377.97ms p(95)=384.79ms
     iterations.....................: 30      2.905946/s
     vus............................: 1       min=1      max=1
     vus_max........................: 1       min=1      max=1


running (0d00h00m10.3s), 0/1 VUs, 30 complete and 0 interrupted iterations
list ✓ [ 100% ] 1 VUs  0d00h00m10.2s/24h0m0s  30/30 iters, 30 per VU