docs/20231222 - RKE2 100 clusters 1vs3 nodes comparison/tests_raw_data/benchmark_RKE31-c_management.cattle.io.setting.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: ./steve_paginated_api_benchmark.js
     output: -

  scenarios: (100.00%) 1 scenario, 1 max VUs, 24h0m30s max duration (incl. graceful stop):
           * list: 30 iterations for each of 1 VUs (maxDuration: 24h0m0s, exec: list, gracefulStop: 30s)


running (0d00h00m01.0s), 1/1 VUs, 18 complete and 0 interrupted iterations
list   [  60% ] 1 VUs  0d00h00m00.8s/24h0m0s  18/30 iters, 30 per VU

     ✓ listing management.cattle.io.setting from cluster local (k8s style pagination) succeeds
     ✓ no slow pagination errors (410 Gone) detected

     █ setup

       ✓ logging in returns status 200

   ✓ checks.........................: 100.00% ✓ 121       ✗ 0  
     data_received..................: 4.8 MB  3.1 MB/s
     data_sent......................: 23 kB   15 kB/s
     http_req_blocked...............: avg=1.38ms   min=250ns   med=280ns   max=80.47ms  p(90)=401ns   p(95)=521ns   
     http_req_connecting............: avg=25.85µs  min=0s      med=0s      max=801.71µs p(90)=0s      p(95)=0s      
     http_req_duration..............: avg=20.71ms  min=8.6ms   med=25.85ms max=76.33ms  p(90)=29.92ms p(95)=30.74ms 
       { expected_response:true }...: avg=20.71ms  min=8.6ms   med=25.85ms max=76.33ms  p(90)=29.92ms p(95)=30.74ms 
     http_req_failed................: 0.00%   ✓ 0         ✗ 61 
     http_req_receiving.............: avg=649.16µs min=54.1µs  med=321µs   max=2.07ms   p(90)=1.29ms  p(95)=1.5ms   
     http_req_sending...............: avg=206.19µs min=31.23µs med=42.74µs max=3.76ms   p(90)=75.03µs p(95)=862.73µs
     http_req_tls_handshaking.......: avg=101.67µs min=0s      med=0s      max=3.27ms   p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=19.86ms  min=8.36ms  med=25.03ms max=76.07ms  p(90)=28.66ms p(95)=29.31ms 
     http_reqs......................: 61      38.836593/s
     iteration_duration.............: avg=50.63ms  min=41.3ms  med=44.95ms max=157.16ms p(90)=52.6ms  p(95)=69.17ms 
     iterations.....................: 30      19.099964/s
     vus............................: 1       min=1       max=1
     vus_max........................: 1       min=1       max=1


running (0d00h00m01.6s), 0/1 VUs, 30 complete and 0 interrupted iterations
list ✓ [ 100% ] 1 VUs  0d00h00m01.4s/24h0m0s  30/30 iters, 30 per VU