docs/20231222 - RKE2 100 clusters 1vs3 nodes comparison/tests_raw_data/benchmark_RKE41-c_management.cattle.io.setting.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: ./steve_paginated_api_benchmark.js
     output: -

  scenarios: (100.00%) 1 scenario, 1 max VUs, 24h0m30s max duration (incl. graceful stop):
           * list: 30 iterations for each of 1 VUs (maxDuration: 24h0m0s, exec: list, gracefulStop: 30s)


running (0d00h00m01.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
list   [   7% ] 1 VUs  0d00h00m00.2s/24h0m0s  02/30 iters, 30 per VU

running (0d00h00m02.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
list   [  33% ] 1 VUs  0d00h00m01.2s/24h0m0s  10/30 iters, 30 per VU

running (0d00h00m03.0s), 1/1 VUs, 20 complete and 0 interrupted iterations
list   [  67% ] 1 VUs  0d00h00m02.2s/24h0m0s  20/30 iters, 30 per VU

running (0d00h00m04.0s), 1/1 VUs, 22 complete and 0 interrupted iterations
list   [  73% ] 1 VUs  0d00h00m03.2s/24h0m0s  22/30 iters, 30 per VU

running (0d00h00m05.0s), 1/1 VUs, 26 complete and 0 interrupted iterations
list   [  87% ] 1 VUs  0d00h00m04.2s/24h0m0s  26/30 iters, 30 per VU

     ✓ listing management.cattle.io.setting from cluster local (k8s style pagination) succeeds
     ✓ no slow pagination errors (410 Gone) detected

     █ setup

       ✓ logging in returns status 200

   ✓ checks.........................: 100.00% ✓ 121       ✗ 0  
     data_received..................: 4.8 MB  927 kB/s
     data_sent......................: 25 kB   4.8 kB/s
     http_req_blocked...............: avg=11.55ms  min=250ns   med=270ns    max=700.82ms p(90)=420ns    p(95)=441ns   
     http_req_connecting............: avg=26.29µs  min=0s      med=0s       max=893.89µs p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=70.32ms  min=15.72ms med=43.35ms  max=549.77ms p(90)=166.98ms p(95)=259.45ms
       { expected_response:true }...: avg=70.32ms  min=15.72ms med=43.35ms  max=549.77ms p(90)=166.98ms p(95)=259.45ms
     http_req_failed................: 0.00%   ✓ 0         ✗ 61 
     http_req_receiving.............: avg=904.96µs min=46.22µs med=698.17µs max=8.23ms   p(90)=1.64ms   p(95)=2ms     
     http_req_sending...............: avg=242.56µs min=31.96µs med=43.23µs  max=4.39ms   p(90)=54.79µs  p(95)=1.79ms  
     http_req_tls_handshaking.......: avg=105.82µs min=0s      med=0s       max=3.43ms   p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=69.18ms  min=15.53ms med=41.5ms   max=549.45ms p(90)=166.03ms p(95)=259.31ms
     http_reqs......................: 61      11.712299/s
     iteration_duration.............: avg=167.97ms min=62.11ms med=75.87ms  max=778.04ms p(90)=432.9ms  p(95)=524.95ms
     iterations.....................: 30      5.760147/s
     vus............................: 1       min=1       max=1
     vus_max........................: 1       min=1       max=1


running (0d00h00m05.2s), 0/1 VUs, 30 complete and 0 interrupted iterations
list ✓ [ 100% ] 1 VUs  0d00h00m04.4s/24h0m0s  30/30 iters, 30 per VU